Расчетные_задачи_занятие_3/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Расчетные_задачи_занятие_3/src/InformationRegisters/ПлановыеДополнительныеНачисления/ПлановыеДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеДополнительныеНачисления</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Расчетные_задачи_занятие_3/src/Enums/СостоянияФизическогоЛица/СостоянияФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияФизическогоЛица</name>
  <comment>Состояния физического лица</comment>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

Расчетные_задачи_занятие_3/src/Documents/НачислениеЗарплаты/ObjectModule.bsl
Процедура Объект_ЗаполнитьТЧ() Экспорт
	
	ОсновныеНачисления.Очистить();
	ДополнительныеНачисления.Очистить();
	Удержания.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиСрезПоследних.Подразделение КАК Подразделение,
		|	СотрудникиСрезПоследних.Должность КАК Должность,
		|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
		|	&НачалоМесяца КАК Период,
		|	СотрудникиСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, ) КАК СотрудникиСрезПоследних
		|ГДЕ
		|	СотрудникиСрезПоследних.Состояние <> &Состояние
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо,
		|	Сотрудники.Подразделение,
		|	Сотрудники.Должность,
		|	Сотрудники.ГрафикРаботы,
		|	Сотрудники.Период,
		|	Сотрудники.Состояние
		|ИЗ
		|	РегистрСведений.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеОсновныеНачисленияСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПлановыеОсновныеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета,
		|	ПлановыеОсновныеНачисленияСрезПоследних.Размер КАК Размер,
		|	&НачалоМесяца КАК Период,
		|	ПлановыеОсновныеНачисленияСрезПоследних.ВидРасчета.ТребуетСбораБазы КАК ТребуетСбораБазы
		|ПОМЕСТИТЬ ВТПлановыеОсновныеНачисления
		|ИЗ
		|	РегистрСведений.ПлановыеОсновныеНачисления.СрезПоследних(&НачалоМесяца, ) КАК ПлановыеОсновныеНачисленияСрезПоследних
		|ГДЕ
		|	ПлановыеОсновныеНачисленияСрезПоследних.Размер > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПлановыеОсновныеНачисления.ФизическоеЛицо,
		|	ПлановыеОсновныеНачисления.ВидРасчета,
		|	ПлановыеОсновныеНачисления.Размер,
		|	ПлановыеОсновныеНачисления.Период,
		|	ПлановыеОсновныеНачисления.ВидРасчета.ТребуетСбораБазы
		|ИЗ
		|	РегистрСведений.ПлановыеОсновныеНачисления КАК ПлановыеОсновныеНачисления
		|ГДЕ
		|	ПлановыеОсновныеНачисления.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеДополнительныеНачисленияСрезПоследних.ФизическоеЛицо,
		|	ПлановыеДополнительныеНачисленияСрезПоследних.ВидРасчета,
		|	ПлановыеДополнительныеНачисленияСрезПоследних.Размер,
		|	&НачалоМесяца КАК Период
		|ПОМЕСТИТЬ ВТПлановыеДополнительныеНачисления
		|ИЗ
		|	РегистрСведений.ПлановыеДополнительныеНачисления.СрезПоследних(&НачалоМесяца, ) КАК ПлановыеДополнительныеНачисленияСрезПоследних
		|ГДЕ
		|	ПлановыеДополнительныеНачисленияСрезПоследних.Размер > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПлановыеДополнительныеНачисления.ФизическоеЛицо,
		|	ПлановыеДополнительныеНачисления.ВидРасчета,
		|	ПлановыеДополнительныеНачисления.Размер,
		|	ПлановыеДополнительныеНачисления.Период
		|ИЗ
		|	РегистрСведений.ПлановыеДополнительныеНачисления КАК ПлановыеДополнительныеНачисления
		|ГДЕ
		|	ПлановыеДополнительныеНачисления.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеУдержанияСрезПоследних.ФизическоеЛицо,
		|	ПлановыеУдержанияСрезПоследних.ВидРасчета,
		|	ПлановыеУдержанияСрезПоследних.Размер,
		|	&НачалоМесяца КАК Период
		|ПОМЕСТИТЬ ВТПлановыеУдержания
		|ИЗ
		|	РегистрСведений.ПлановыеУдержания.СрезПоследних(&НачалоМесяца, ) КАК ПлановыеУдержанияСрезПоследних
		|ГДЕ
		|	ПлановыеУдержанияСрезПоследних.Размер > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПлановыеУдержания.ФизическоеЛицо,
		|	ПлановыеУдержания.ВидРасчета,
		|	ПлановыеУдержания.Размер,
		|	ПлановыеУдержания.Период
		|ИЗ
		|	РегистрСведений.ПлановыеУдержания КАК ПлановыеУдержания
		|ГДЕ
		|	ПлановыеУдержания.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПлановыеОсновныеНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСотрудники.Подразделение КАК Подразделение,
		|	ВТСотрудники.Должность КАК Должность,
		|	ВТПлановыеОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВТПлановыеОсновныеНачисления.Размер КАК Размер,
		|	ВТПлановыеОсновныеНачисления.Период КАК Период,
		|	ВТСотрудники.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТСотрудники.Состояние КАК Состояние,
		|	ВТПлановыеОсновныеНачисления.ТребуетСбораБазы КАК ТребуетСбораБазы
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлановыеОсновныеНачисления КАК ВТПлановыеОсновныеНачисления
		|		ПО (ВТПлановыеОсновныеНачисления.ФизическоеЛицо = ВТСотрудники.ФизическоеЛицо)
		|			И (ВТПлановыеОсновныеНачисления.Период = ВТСотрудники.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|ИТОГИ ПО
		|	ФизическоеЛицо,
		|	ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПлановыеДополнительныеНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСотрудники.Подразделение КАК Подразделение,
		|	ВТСотрудники.Должность КАК Должность,
		|	ВТПлановыеДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВТПлановыеДополнительныеНачисления.Размер КАК Размер,
		|	ВТПлановыеДополнительныеНачисления.Период КАК Период,
		|	ВТСотрудники.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТСотрудники.Состояние КАК Состояние,
		|	ВТПлановыеДополнительныеНачисления.ВидРасчета.ТребуетСбораБазы КАК ТребуетСбораБазы
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлановыеДополнительныеНачисления КАК ВТПлановыеДополнительныеНачисления
		|		ПО (ВТПлановыеДополнительныеНачисления.ФизическоеЛицо = ВТСотрудники.ФизическоеЛицо)
		|			И (ВТПлановыеДополнительныеНачисления.Период = ВТСотрудники.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|ИТОГИ ПО
		|	ФизическоеЛицо,
		|	ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПлановыеУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСотрудники.Подразделение КАК Подразделение,
		|	ВТСотрудники.Должность КАК Должность,
		|	ВТПлановыеУдержания.ВидРасчета КАК ВидРасчета,
		|	ВТПлановыеУдержания.Размер КАК Размер,
		|	ВТПлановыеУдержания.Период КАК Период,
		|	ВТСотрудники.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТСотрудники.Состояние КАК Состояние,
		|	ВТПлановыеУдержания.ВидРасчета.ТребуетСбораБазы КАК ТребуетСбораБазы
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлановыеУдержания КАК ВТПлановыеУдержания
		|		ПО (ВТПлановыеУдержания.ФизическоеЛицо = ВТСотрудники.ФизическоеЛицо)
		|			И (ВТПлановыеУдержания.Период = ВТСотрудники.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|ИТОГИ ПО
		|	ФизическоеЛицо,
		|	ВидРасчета";
	
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоМесяца", ПериодРегистрации);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияФизическогоЛица.Уволен);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатов.Получить(4);
	
	ВыборкаФизическоеЛицо = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФизическоеЛицо.Следующий() Цикл
		
		ВыборкаВидРасчета = ВыборкаФизическоеЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаВидРасчета.Следующий() Цикл
			
			ПериодДействияКонец = КонецМесяца(ПериодРегистрации);
			
			ВыборкаДетальныеЗаписи = ВыборкаВидРасчета.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				Если ВыборкаДетальныеЗаписи.Размер = 0 Тогда
					
					ПериодДействияКонец = КонецДня(ВыборкаДетальныеЗаписи.Период);
					Продолжить;
					
				КонецЕсли;
					
					НоваяСтрока = ОсновныеНачисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
					
					НоваяСтрока.ПериодДействияКонец = ПериодДействияКонец;
					НоваяСтрока.ПериодДействияНачало = ВыборкаДетальныеЗаписи.Период;
					
					Если ВыборкаДетальныеЗаписи.ТребуетСбораБазы Тогда
					
						НоваяСтрока.БазовыйПериодКонец = ПериодДействияКонец;
						НоваяСтрока.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.Период;
					
					КонецЕсли;
					
					ПериодДействияКонец = ВыборкаДетальныеЗаписи.Период - 1;
					
				КонецЦикла;
				
		КонецЦикла;
	КонецЦикла;
	
	//----------------------------------
	
	РезультатЗапроса = МассивРезультатов.Получить(5);
	
	ВыборкаФизическоеЛицо = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФизическоеЛицо.Следующий() Цикл
		
		ВыборкаВидРасчета = ВыборкаФизическоеЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаВидРасчета.Следующий() Цикл
			
			ПериодДействияКонец = КонецМесяца(ПериодРегистрации);
			
			ВыборкаДетальныеЗаписи = ВыборкаВидРасчета.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				Если ВыборкаДетальныеЗаписи.Размер = 0 Тогда
					
					ПериодДействияКонец = КонецДня(ВыборкаДетальныеЗаписи.Период);
					Продолжить;
					
				КонецЕсли;
					
					НоваяСтрока = ДополнительныеНачисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
					
					Если ВыборкаДетальныеЗаписи.ТребуетСбораБазы Тогда
					
						НоваяСтрока.БазовыйПериодКонец = ПериодДействияКонец;
						НоваяСтрока.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.Период;
					
					КонецЕсли;
					
					ПериодДействияКонец = ВыборкаДетальныеЗаписи.Период - 1;
					
				КонецЦикла;
				
		КонецЦикла;
	КонецЦикла;
	

	//----------------------
	
	РезультатЗапроса = МассивРезультатов.Получить(6);
	
	ВыборкаФизическоеЛицо = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФизическоеЛицо.Следующий() Цикл
		
		ВыборкаВидРасчета = ВыборкаФизическоеЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаВидРасчета.Следующий() Цикл
			
			ПериодДействияКонец = КонецМесяца(ПериодРегистрации);
			
			ВыборкаДетальныеЗаписи = ВыборкаВидРасчета.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				Если ВыборкаДетальныеЗаписи.Размер = 0 Тогда
					
					ПериодДействияКонец = КонецДня(ВыборкаДетальныеЗаписи.Период);
					Продолжить;
					
				КонецЕсли;
					
					НоваяСтрока = Удержания.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
					
					Если ВыборкаДетальныеЗаписи.ТребуетСбораБазы Тогда
					
						НоваяСтрока.БазовыйПериодКонец = ПериодДействияКонец;
						НоваяСтрока.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.Период;
					
					КонецЕсли;
					
					ПериодДействияКонец = ВыборкаДетальныеЗаписи.Период - 1;
					
				КонецЦикла;
				
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


Процедура РассчитатьРесурсы() Экспорт 

	

КонецПроцедуры
